package apc.appcradle.inlinefunctions

/**
 * #### Что означает модификатор noinline и когда он используется?
 *
 * Рассмотрим ситуацию: у нас есть inline-функция с двумя лямбда-параметрами. Мы хотим:
 *- Один параметр остался inline (для оптимизации)
 *- Второй параметр преобразовать в обычный функциональный тип (например, чтобы передать в другую не-inline функцию)
 *
 * Напишите пример функции process с двумя лямбда-параметрами, где первый — inline, а второй — noinline.
 *
 * Ответ - [NoInlineAnswer]
 */
fun main() {

}

